## Автоматизация списка

<details>
  <summary>Условие</summary>
  Многим весьма часто приходится вести списки продуктов, дел и так далее.

  Напишите программу, которая преобразует введённую строку в нумерованный список.
  
  ### Формат ввода
  Вводится одна строка.
  
  ### Формат вывода
  Требуется вывести нумерованный список, составленный из её слов.


</details>

<details>
  <summary>Решение</summary>

  ```python
  for index, value in enumerate(text := input().split(), 1):
      print(f'{index}. {value}')
  ```

</details>

## Сборы на прогулку

<details>
  <summary>Условие</summary>
  Воспитатель в детском саду устал тратить время, чтобы построить детей по парам.

  Он договорился с детьми, чтобы те делились на две, по возможности равные, группы.
  
  Напишите программу, которая по списку двух шеренг составляет пары детей.
  
  ### Формат ввода
  Вводится две строки с именами детей, записанными через запятую и пробел.
  
  ### Формат вывода
  Требуется вывести список пар, которые можно составить, если последовательно брать из каждой шеренги по одному ребёнку.
  Имена в парах выводить через дефис окружённый пробелами.
  
  ### Примечание
  В одной из групп может быть на одного ребенка больше, чем в другой.
  Этот ребёнок при формировании пар не учитывается и идёт в паре с воспитателем.


</details>

<details>
  <summary>Решение</summary>

  ```python
  pairs = list(zip(text := input().split(","), text_2 := input().split(",")))
  for value in pairs:
      print(f'{value[0]} - {value[1].lstrip(" ")}'.lstrip(" "))

  ```

</details>

## Рациональная считалочка

<details>
  <summary>Условие</summary>
  Напишите программу, которая производит счёт по заданным параметрам.

  ### Формат ввода
  В одну строку через пробел вводятся 3 рациональных числа — начало счета, конец и шаг.
  
  ### Формат вывода
  Последовательность чисел с заданными параметрами.


</details>

<details>
  <summary>Решение</summary>

  ```python
  from itertools import count

  start, end, step = [float(i) for i in input().split()]
  for value in count(start, step):
      if value <= end:
          print(f'{value:.2f}')
      else:
          break

  ```

</details>

## Словарная ёлка

<details>
  <summary>Условие</summary>
  Напишите программу, которая преобразует строку слов в ёлку как показано в примере.

  ### Формат ввода
  В одну строку через пробел вводятся слова разделенные пробелом.
  
  ### Формат вывода
  Несколько строк. В каждой следующей строке на одно слово больше.
  
  ### Примечание
  accumulate «складывает» не только числа.


</details>

<details>
  <summary>Решение</summary>

  ```python
  from itertools import accumulate
  text = input().replace(" ", " ,").split(",")
  for value in accumulate(text):
      print(f'{value}')
  ```

</details>

## Список покупок

<details>
  <summary>Условие</summary>
  Поход в магазин часто вызывает проблемы. Если не подготовить список, можно уйти в магазин за хлебом, а вернуться с десятком пакетов. Напишите программу, которая собирает пожелания семьи (мамы, папы и дочки) в единый список.

  ### Формат ввода
  В трёх строках записаны желаемые продукты (через запятую и пробел).
  
  ### Формат вывода
  Отсортированный по алфавиту список продуктов с нумерацией.
  
  ### Примечание
  Помните, что итераторы можно применять к другим итераторам.


</details>

<details>
  <summary>Решение</summary>

  ```python
  text = input().split(", ")
  for i in range(2):
      for word in input().split(", "):
          text.append(word)
  
  for index, value in enumerate(sorted(text), 1):
      print(f'{index}. {value}')
  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>

## Для копирования

<details>
  <summary>Условие</summary>



</details>

<details>
  <summary>Решение</summary>

  ```python

  ```

</details>
